# coding=utf-8


def get_review_selector(idscheme):
    a = {
        '1': u"(//ul//*[contains(text(), 'Оцінка умов закупівлі')])[2]",
        '2': u"(//ul//*[contains(text(), 'Чіткість/зрозумілість вимог до предмету закупівлі')])[2]",
        '3': u"(//ul//*[contains(text(), 'Неупередженість/недискримінаційність вимог закупівлі')])[2]",
        '4': u"(//ul//*[contains(text(), 'Неупередженість/недискримінаційність вимог до учасника')])[2]",
        '5': u"(//ul//*[contains(text(), 'Правильність застосування кодів класифікаторів')])[2]",
        '6': u"(//ul//*[contains(text(), 'Правильність визначення очікуваної вартості')])[2]",
        '7': u"(//ul//*[contains(text(), 'Доцільність використання лотів')])[2]",
        '8': u"(//ul//*[contains(text(), 'Доцільність використання банківської гарантії')])[2]",
        '9': u"(//ul//*[contains(text(), 'Правомірність відміни закупівлі')])[2]",
        '10': u"(//ul//*[contains(text(), 'Оцінка взаємодії замовника із учасниками')])[2]",
        '11': u"(//ul//*[contains(text(), 'Оцінка якості та справедливості процесу кваліфікації')])[2]",
        '12': u"(//ul//*[contains(text(), 'Оцінка виконання замовником умов договору про закупівлю (для постачальника)')])[2]",
        '13': u"(//ul//*[contains(text(), 'Оцінка виконання постачальником умов договору про закупівлю (для замовника)')])[2]",
    }
    return a[idscheme]

def get_review_info(idscheme):
    a = {
        '1': u"(//h5[contains(text(), 'Оцінка умов закупівлі')])[1]",
        '2': u"(//h5[contains(text(), 'Чіткість/зрозумілість вимог до предмету закупівлі')])[1]",
        '3': u"(//h5[contains(text(), 'Неупередженість/недискримінаційність вимог закупівлі')])[1]",
        '4': u"(//h5[contains(text(), 'Неупередженість/недискримінаційність вимог до учасника')])[1]",
        '5': u"(//h5[contains(text(), 'Правильність застосування кодів класифікаторів')])[1]",
        '6': u"(//h5[contains(text(), 'Правильність визначення очікуваної вартості')])[1]",
        '7': u"(//h5[contains(text(), 'Доцільність використання лотів')])[1]",
        '8': u"(//h5[contains(text(), 'Доцільність використання банківської гарантії')])[1]",
        '9': u"(//h5[contains(text(), 'Правомірність відміни закупівлі')])[1]",
        '10': u"(//h5[contains(text(), 'Оцінка взаємодії замовника із учасниками')])[1]",
        '11': u"(//h5[contains(text(), 'Оцінка якості та справедливості процесу кваліфікації')])[1]",
        '12': u"(//h5[contains(text(), 'Оцінка виконання замовником умов договору про закупівлю (для постачальника)')])[1]",
        '13': u"(//h5[contains(text(), 'Оцінка виконання постачальником умов договору про закупівлю (для замовника)')])[1]",
    }
    return a[idscheme]



