# coding=utf-8


forms_1_to_8_10 = [
        u'Оцінка умов закупівлі',
        u'Чіткість/зрозумілість вимог до предмету закупівлі',
        u'Неупередженість/недискримінаційність вимог закупівлі',
        u'Неупередженість/недискримінаційність вимог до учасника',
        u'Правильність застосування кодів класифікаторів',
        u'Правильність визначення очікуваної вартості',
        u'Доцільність використання лотів',
        u'Доцільність використання банківської гарантії',
        u'Оцінка взаємодії замовника із учасниками',
    ]

forms_9 = [
        u'Правомірність відміни закупівлі',
]


forms_9_multylot = [
        u'Доцільність використання лотів',
        u'Правомірність відміни закупівлі',
]


forms_11_to_12 = [
        u'Оцінка якості та справедливості процесу кваліфікації',
        u'Оцінка виконання замовником умов договору про закупівлю (для постачальника)',
]

forms_11_to_12_multylot = [
        u'Доцільність використання лотів',
        u'Оцінка якості та справедливості процесу кваліфікації',
        u'Оцінка виконання замовником умов договору про закупівлю (для постачальника)',
]

forms_13 = [
        u'Оцінка виконання постачальником умов договору про закупівлю (для замовника)',
]

forms_13_multylot = [
        u'Доцільність використання лотів',
        u'Оцінка виконання постачальником умов договору про закупівлю (для замовника)',
]